import re

print("############")
s = 'var szzbAffiches=[["603900","finalpage/2016-10-31/1202807707.PDF",'\
    '"通灵珠宝：首次公开发行股票招股意向书附录","PDF","60611","2016-10-31",'\
    '"2016-10-31 00:00"],["603987","finalpage/2016-10-31/1202807523.PDF",'\
    '"康德莱：首次公开发行股票招股意向书摘要","PDF","1475","2016-10-31",'\
    '"2016-10-31 00:00"],["603987","finalpage/2016-10-31/1202807522.PDF",'\
    '"康德莱：首次公开发行股票招股意向书","PDF","9578","2016-10-31",'\
    '"2016-10-31 00:00"],["603987","finalpage/2016-10-31/1202807521.PDF",'\
    '"康德莱：首次公开发行股票招股意向书附录","PDF","41593","2016-10-31",'\
    '"2016-10-31 00:00"],["603987","finalpage/2016-10-31/1202807519.PDF",'\
    '"康德莱：首次公开发行股票发行安排及初步询价公告","PDF","652","2016-10-31",'\
    '"2016-10-31 00:00"],["603977","finalpage/2016-10-31/1202807520.PDF",'\
    '"国泰集团：首次公开发行股票招股说明书","PDF","3799","2016-10-31",'\
    '"2016-10-31 00:00"]]'
print(s)

reg = re.compile(r'(\[\".+?\"\][,|\]])')

l = re.findall( reg, s )
for item in l:
    print("----------------------")
    print(item)
    
    reg2 = re.compile(r'(\".+?\"[,|\]])')
    l2 = re.findall( reg2, item)
    # 下面的dict是为了映射 每条公告信息的项目对应关系
    d = {"0":"stockcode","1":"url","2":"name","3":"type","4":"flag","5":"date","6":"time"}
    i = 0
    rec = {}
    for item2 in l2:
        print("====")
        ll = len(item2)
        print(d["%d" % i]+":"+item2[1:ll-2])
        rec[d["%d" % i]] = item2[1:ll-2]
        i += 1

    print(rec)
    
s2 = '["603987","finalpage/2016-10-31/1202807519.PDF","康德莱：首次公开发行股票发行安排及初步询价公告","PDF","652","2016-10-31","2016-10-31 00:00"],"603977","finalpage/2016-10-31/1202807520.PDF","国泰集团：首次公开发行股票招股说明书","PDF","3799","2016-10-31","2016-10-31 00:00"]]'


dict1=[]
